# В игре участвуют два игрока. Множество карт игрока представлено списком.
# Элемент списка имеет следующую структуру: название масти, название карты. 
# Также задан второй список, в котором каждой карте колоды сопоставляется «стоимость» - некоторое число. 
# Написать функцию, которая по всем картам заданной масти определяет, у кого из игроков стоимость карт этой масти максимальная.
# Написать функцию, которая определяет, какие карты остались в колоде.
player1 = [["черви", "1"],["черви", "2"],["бубн", "дама"]]
player2 = [["бубн", "1"],["крести", "2"],["пики", "4"]]
cost = [["черви", "1", 1],["черви", "2", 2],["черви", "3", 3],["черви", "4", 4],["черви", "валет", 10],["черви", "дама", 20],["черви", "туз", 10 ],
["пики", "1", 1],["пики", "2", 2],["пики", "3", 3],["пики", "4", 4],["пики", "валет", 10],["пики", "дама", 20],["пики", "туз", 10 ],
["крести", "1", 1],["крести", "2", 2],["крести", "3", 3],["крести", "4", 4],["крести", "валет", 10],["крести", "дама", 20],["крести", "туз", 10 ],
["бубн", "1", 1],["бубн", "2", 2],["бубн", "3", 3],["бубн", "4", 4],["бубн", "бубн", 10],["бубн", "дама", 20],["бубн", "туз", 10 ]]

# Написать функцию, которая по всем картам заданной масти определяет, у кого из игроков стоимость карт этой масти максимальная.

def defCost(card):
    for c in cost:
        if(c[0] == card[0] and c[1] == card[1]):
            return c[2]
            
def MaxCost(pl1, pl2, mast):
    sum1 = 0
    sum2 = 0
    for card in pl1:
        if(card[0] == mast):
            sum1 = sum1 + defCost(card)
    for card in pl2:
        if(card[0] == mast):
            sum2 = sum2 + defCost(card)       
    if(sum1 >= sum2 ):
        return "1 player"
    else: return "2 player"
    
# Написать функцию, которая определяет, какие карты остались в колоде.
def Last(pl1, pl2):
    lst = []
    for card in cost:
        for card1 in pl1:
            if(card1[0] != card[0] and card1[1] != card[1]):
                lst.append(card)
                
    for card in lst:
        for card2 in pl2:
            if(card2[0] == card[0] and card2[1] == card[1]):
                lst.remove(card)
    return lst
    
    
def main():
    print(MaxCost(player1, player2, "пики"))
    print(Last(player1, player2))

main()
